Repository: AKotov-dev/docker-manager
Catalog: docker-manager/languages/docker_manager.*.po
Languages: ru

# tdfileform.dfdirbtn.hint
source: Project files
ru: Файлы проекта

source: Create an image:
ru: Создать образ:

# tfilesform.addbtn.hint
source: Add files
ru: Добавить файлы

# tfilesform.caption
source: Project files
ru: Файлы проекта

# tfilesform.deletebtn.hint
source: Delete files
ru: Удалить файлы

source: Refresh the list
ru: Обновить список

# tloginform.caption
source: Login to DockerHub
ru: Зайти в DockerHub

# tloginform.label1.caption
source: Name:
ru: Имя:

# tloginform.label2.caption
source: Password:
ru: Пароль:

source: Run image with parameters (optional)
ru: Запустить образ с параметрами (опционально)

source: Run and goto Shell with --rm > /bin/bash
ru: Запустить и зайти в Shell с --rm >/bin/bash

source: Сontainer version information
ru: Информация о версии контейнера

source: Create a new image from this container
ru: Создать новый образ из этого контейнера

source: Create a backup of this image
ru: Создать бэкап этого образа

source: Restore docker image(s) from backup
ru: Восстановить образ(ы) docker из бэкапа

# tmainform.menuitem15.caption
source: Selected only
ru: Только выбранные

source: All untagged (prune -f)
ru: Все неотмеченные (prune -f)

source: All without containers (prune -f -a)
ru: Все без контейнеров (prune -f -a)

# tmainform.menuitem18.caption
source: Selected only
ru: Только выбранные

source: All stoped (prune -f)
ru: Все остановленные (prune -f)

# tmainform.menuitem2.caption
source: Removing image(s)
ru: Удалить образ(ы)

source: Create an image via Dockerfile
ru: Создать образ через Dockerfile

# tmainform.menuitem21.caption
source: Selected only
ru: Только выбранные

source: All containers
ru: Все контейнеры

source: Import a tar archive and create a image
ru: Импортировать архив tar и создать образ

source: Export a container as a tar archive
ru: Экспортировать контейнер в архив tar

source: Rename this container
ru: Переименовать этот контейнер

source: Rename this image (name:tag)
ru: Переименовать этот образ (name:tag)

source: Push this image to DockerHub
ru: Отправить этот образ в DockerHub

# tmainform.menuitem28.caption
source: Login to DockerHub
ru: Зайти в DockerHub

source: Push an image to DockerHub
ru: Отправить образ в DockerHub

source: Start container
ru: Запустить контейнер

source: Stop container(s)
ru: Остановить контейнер(ы)

source: Removing container(s)
ru: Удалить контейнер(ы)

source: Start and goto Shell > /bin/bash
ru: Запустить и зайти в Shell > /bin/bash

source: Pull image (name:tag)
ru: Получить образ (name:tag)

source: Run image with parameters --rm (optional)
ru: Запустить образ с параметрами --rm (опционально)

source: Run and goto Shell > /bin/bash
ru: Запустить и зайти в Shell > /bin/bash

source: License: GPLv3 Author: alex_q_2000 (C) 2022 URL: https://github.com/AKotov-dev/docker-manager
ru: Лицензия: GPLv3 Автор: alex_q_2000 (C) 2022 URL: https://github.com/AKotov-dev/docker-manager

source: Do you confirm the deletion?
ru: Вы подтверждаете удаление?

source: Create a new Image
ru: Создать новый образ

source: Delete selected files?
ru: Удалить выбранные файлы?

source: ...the main image is not selected; will be retrieved from DockerHub
ru: ...основной образ не выбран; будет получен из DockerHub

source: Warning! Docker not running! Launch Docker: systemctl restart docker.service
ru: Внимание! Docker не запущен! Запустите Docker: systemctl restart docker.service

source: Import from a tar archive
ru: Импорт из архива tar

source: Warning! Include the user in the docker group and restart the computer: usermod -aG docker $LOGNAME; reboot
ru: Внимание! Включите пользователя в группу docker и перезагрузите компьютер: usermod -aG docker $LOGNAME; reboot

source: (Pause lists...)
ru: (Пауза списков...)

source: Pull image
ru: Получить образ

source: Enter name:tag or name/repository
ru: Введите name:tag или name/repository

source: Renaming
ru: Переименование

source: Enter a new name:
ru: Введите новое имя:

source: Run image
ru: Запуск образа

source: Enter the parameters (sample: -p 8080:80 or echo "hello")
ru: Введите команду (пример: -p 8080:80 или echo "hello")

source: Run image with --rm
ru: Запуск образа с --rm
